IDENTIFICATION DIVISION.

PROGRAM-ID. SUBMISSION.

DATA DIVISION.
WORKING-STORAGE SECTION.
01 N PIC 9(2) VALUE 0.

PRODURE DIVISION.
    ACCEPT N
    DISPLAY N - 1
    STOP RUN.