        IDENTIFICATION DIVISION.

        PROGRAM-ID. SUBMISSION.

        DATA DIVISION.
        WORKING-STORAGE SECTION.
        01 ARR.
            05 ARR1 OCCURS 1000000 TIMES PIC S9(16) VALUE ZEROS.
            05 ARR2 OCCURS 1000000 TIMES PIC S9(16) VALUE ZEROS.
            05 ARR3 OCCURS 1000000 TIMES PIC S9(16) VALUE ZEROS.
            05 ARR4 OCCURS 1000000 TIMES PIC S9(16) VALUE ZEROS.
            05 ARR5 OCCURS 1000000 TIMES PIC S9(16) VALUE ZEROS.
            05 ARR6 OCCURS 1000000 TIMES PIC S9(16) VALUE ZEROS.
            05 ARR7 OCCURS 1000000 TIMES PIC S9(16) VALUE ZEROS.
            05 ARR8 OCCURS 1000000 TIMES PIC S9(16) VALUE ZEROS.
            05 ARR9 OCCURS 1000000 TIMES PIC S9(16) VALUE ZEROS.

        PROCEDURE DIVISION.
            DISPLAY 'START RUN'.
            STOP RUN.
